Repository: mastersign/odec
Catalog: src/clr/odec/cli/Resources.*.resx
Languages: de_de

# CertificateFileNotFound
source: The certificate file was not found.
de_de: Die Datei welche das Zertifikat enthält wurde nicht gefunden.

# Error_CopyingStorageFile
source: Error while copying storage file '{0}': {1}
de_de: Fehler während des Kopierens des Storage File '{0}': {1}

# Error_CreatingEntity
source: Error while creating new entity. {0}
de_de: Fehler beim Anlegen des neuen Entity. {0}

# Error_CreatingTargetContainer
source: Error while creating the target container: {0}
de_de: Fehler beim Erzeugen des Ziel-Containers: {0}

# Error_InitializingContainer
source: Error while initializing the container: {0}
de_de: Fehler beim Initialisieren des Containers: {0}

# Error_NameOfProvenanceParameterSetIsEmpty
source: Name of provenance parameter set is empty.
de_de: Der Name des Provenance Parameter Set ist leer.

# Error_NameOfValueIsEmpty
source: Name of entity value is empty.
de_de: Der Name des Entity Value ist leer.

# Error_OpeningSourceContainer
source: Error while opening the source container: {0}
de_de: Fehler beim Öffnen des Quell-Containers: {0}

# Error_ProfileMismatch
source: The given profile '{0}' does not match the container profile '{1}'.
de_de: Das angegebene Profil '{0}' stimmt nicht dem Profil des Containers '{1}' überein.

# Error_ProfileVersionMismatch
source: The given profile version '{0} does not match the container profile version '{1}'.
de_de: Die angegebene Profilversion '{0} stimmt nicht mit der Profilversion des Containers '{1}' überein.

# Error_ProvenanceParameterSetSourceFileNotFound
source: The given provenance parameter set source file does not exist. {0}
de_de: Die angegebene Quelldatei für das Provenance Parameter Set wurde nicht gefunden. {0}

# Error_ReadingCertificate
source: Error while reading certificate: {0}
de_de: Fehler während dem Lesen des Zertifikats: {0}

# Error_ReadingPrivateKey
source: Error while reading private key: {0}
de_de: Fehler beim Lesen des privaten Schlüssels: {0}

# Error_SealingContainer
source: Error while sealing the container: {0}
de_de: Fehler beim versiegeln des Containers: {0}

# Error_StoringEntity
source: Error while storing a new entity. {0}
de_de: Fehler beim Speichern des neuen Entity. {0}

# Error_UnexpectedReinstateError
source: Unexpected error while reinstating history edition.
de_de: Bei der Wiedereinsetzung der Edition ist ein unerwarteter Fehler aufgetreten.

# Error_ValidationStep1Failed
source: Validation step 1 failed. Container structure is invalid.
de_de: Validierungsschritt 1 fehlgeschlagen. Container-Struktur ist ungültig.

# Error_ValidationStep2Failed
source: Validation step 2 failed. Value integrity damaged.
de_de: Validierungsschritt 2 fehlgeschlagen. Integrität des Entity-Wertes beschädigt.

# Error_ValidationStep3Failed
source: Validation step 3 failed. Owner certificate invalid.
de_de: Validierungsschritt 3 fehlgeschlagen. Das Owner-Zertifikat ist ungültig.

# Error_ValidationStep4Failed
source: Validation step 4 failed. Container is not conform to profile.
de_de: Validierungsschritt 4 fehlgeschlagen. Der Container ist nicht profilkonform.

# Error_ValueSourceFileNotFound
source: The given entity value source file does not exist. {0}
de_de: Die angegebene Quelldatei für den Entity-Wert wurde nicht gefunden. {0}

# PrivateKeyNotFound
source: The private key file was not found.
de_de: Die Datei mit dem privatem Schlüssel wurde nicht gefunden.

# StorageTypeNotSupported
source: The choosen storage type is not supported.
de_de: Der gewählte Storage-Typ wird nicht unterstützt.

# Warning_ConatinerNotFound
source: The given container was not found: {0}
de_de: Der angegebene Container wurde nicht gefunden: {0}

# Warning_ContainerAllreadyExists
source: The given container allready exists: {0}
de_de: Der angegebene Ziel-Container existiert bereits: {0}

# Warning_EditionIdNotFound
source: The given edition ID was not found in the container history.
de_de: Die übergebene Edition-ID wurde in der Container-History nicht gefunden.

# Warning_FileNotFound
source: The file does not exists: {0}
de_de: Die Datei wurde nicht gefunden: {0}

# Warning_InPlaceTransformationNotSupported
source: In place transformation is not supported.
de_de: In-Place-Transformation wird nicht unterstützt.

# Warning_InvalidMode
source: The given value for the argument '-mode, -m <working mode>' is invalid.
de_de: Der angegebene Wert für das Argument '-mode, -m <working mode>' ist ungültig.

# Warning_InvalidStorageType
source: The given value for the argument '-storage, -s <storage type>' is invalid.
de_de: Der angegebene Wert für das Argument '-storage, -s <storage type>' ist ungültig.

# Warning_NoContainerPathGiven
source: No container path given. Use '-c <file/dir>'.
de_de: Es wurde kein Pfad für den Container angegeben. Verwenden Sie '-c <file/dir>'.

# Warning_NoEntityDescriptionFile
source: No entity descriptions given. Use '-e <desciption file>'.
de_de: Es wurde keine Entity-Beschreibungsdatei angegeben. Verwenden Sie '-e <desciption file>'.

# Warning_NoOwnerDescriptionFile
source: No owner description file given. Use '-o <owner file>'.
de_de: Es wurde keine Owner-Beschreibungsdatei angegeben. Verwenden Sie '-o <owner file>'.

# Warning_NoProfileFile
source: No profile file given. Use '-p <profile file>'.
de_de: Keine Profil-Datei angegeben. Verwenden Sie '-p <profile file>'.

# Warning_NoTargetPath
source: No target path given. Use '-t <target file/dir>'.
de_de: Kein Zielpfad angegeben. Verwenden Sie '-t <target file/dir>'.

# Warning_NoValidTargetEditionId
source: No valid target edition ID given.
de_de: Es wurde keine gültige Edition-ID übergeben.

# Warning_ReinstatingImpossible
source: Reinstating the given edition as current edition is not possible.
de_de: Die angegene Edition kann nicht wieder eingesetzt werden.

# Warning_StorageTypeNotSupported
source: The given target storage type is not supported.
de_de: Der angegebene Storage-Typ für den Ziel-Container wird nicht unterstützt.

# Warning_TargetPathAllreadyExists
source: The given target path allready exists: {0}
de_de: Der angegebene Zielpfad existiert bereits: {0}

# XML_FileAccessDenied
source: Access denied for reading the XML file '{0}': {1}
de_de: Zugriff verweigert bei dem Zugriff auf die XML-Datei '{0}': {1}

# XML_FileNotFound
source: The XML file '{0}' was not found: {1}
de_de: Die XML-Datei '{0}' wurde nicht gefunden: {1}

# XML_ParsingError
source: Error while parsing the XML file '{0}': {1}
de_de: Fehler beim Parsen der XML-Datei '{0}': {1}

# XML_ReadingError
source: Error while reading the XML file '{0}': {1}
de_de: Fehler beim Lesen der XML-Datei '{0}': {1}

# XML_UnexpectedRootElement
source: The XML file '{0}' does not contain the expected root element '{1}'.
de_de: Die XML-Datei '{0}' enthält nicht das erwartete Wurzelelement '{1}'.

# XML_ValidationError
source: Error while validation of XML file '{0}':{1}{2}
de_de: Fehler beim Validieren der XML-Datei: '{0}':{1}{2}
