Repository: mastersign/odec
Catalog: src/clr/odec/Properties/Resources.*.resx
Languages: de_de

# Value_WriteAndSignValue_InvalidOperation_ValueAllreadyStored
source: The value is allready stored.
de_de: Der Wert wurde bereits gespeichert.

# XmlStorable_WriteToXml_ThisInstanceIsInvalid
source: This instance is invalid.
de_de: Die Instanz ist ungültig.

# XmlUtils_ReadParsedObject_ArgumentException_NameIsEmpty
source: The given name is empty.
de_de: Der übergebene Name ist leer.

# ZipStorage_ArgumentException_InvalidPathCharacters
source: The specified path contains invalid characters.
de_de: Der angegebene Pfad enthält ungültige Zeichen.

# ZipStorage_Name
source: ZIP-File
de_de: ZIP-Datei
