Repository: mastersign/odec
Catalog: src/clr/odec/Properties/Resources.*.resx
Languages: de_de

# ArgumentException_EmptyString
source: The given string is empty.
de_de: Die übergebene Zeichenfolge ist leer.

# BclC14NCanonicalizer_Canonize_NotSupported_StreamAsOutput
source: The XML transformation into canonical representation does not support Stream as output.
de_de: Die XML-Transformation in eine kanonische Form unterstützt Stream nicht als Ausgabe.

# BclC14NCanonicalizer_Canonize_NotSupported_XmlDocumentAsInput
source: The XML transformation into canonical representation does not support XmlDocument as input.
de_de: Die XML-Transformation in eine kanonische Form unterstützt XmlDocument nicht als Eingabe.

# BclKeyHelper_DecodePem_ArgumentException_TypeNotFound
source: Given type not found in the text.
de_de: Der übergebene Typ wurde im Text nicht gefunden.

# BclKeyHelper_DecodeRSAPrivateKey_FormatException_ErrorParsingPrivateKey
source: Error while parsing private key.
de_de: Beim Parsen des privaten Schlüssels ist ein Fehler aufgetreten.

# BouncyCastleKeyHelper_ExtractPem_NoPemData
source: The given text does not contain PEM encoded data with the id '{0}'.
de_de: Die übergebene Zeichenfolge enthält keine PEM-kodierten Daten mit der ID {0}.

# CatalogBase_CopyTo_ArgumentException_MoreThanOneDimension
source: The given array has more than one dimension.
de_de: Das übergebene Array hat mehr als eine Dimension.

# CatalogBase_CopyTo_ArgumentException_NotEnoughSpace
source: There is not enough space in the array for all items of the catalog.
de_de: In dem Array ist nicht ausreichend Platz für alle Elemente des Katalogs.

# CatalogItem_LoadFromXml_FormatException_InvalidGuid
source: The GUID in the given XML element is not valid.
de_de: Die GUID in dem übergebenen XML-Element ist ungültig.

# CompatibilityFlags_None
source: None
de_de: kein

# CompatibilityFlags_SupressStructureXMLCanonicalization
source: supress structure XML canonicalization
de_de: XML-Struktur-Dateien nicht kanonisieren

# CompatibilityFlags_WriteXmlSignatureCanonicalized
source: write signature canonicalized
de_de: XML-Signaturen kanonisiert speichern

# Container_ArgumentException_EntityDoesNotExist
source: The specified entity does not exist.
de_de: Das angegebene Entity existiert nicht.

# Container_ArgumentNullException_LabelNotFound
source: The given label was not found in the index.
de_de: Das übergebene Label wurde im Index nicht gefunden.

# Container_CanReinstateHistoryEdition_ArgumentException_EditionNotFound
source: The given ID was not found in the history.
de_de: Die angegebene Edition-ID wurde in der Container-History nicht gefunden.

# Container_CanReinstateHistoryEdition_InvalidOperation_WrongPhase
source: The container must be in the process phase 'Sealed' to allow this operation.
de_de: Der Container muss sich in der Prozessphase 'Sealed' befinden, damit diese Operation erlaubt ist.

# Container_CanReinstateHistoryEdition_Reason_EntityRemoved
source: A following edition has removed an entity that is needed to reinstate the specified edition.
de_de: Eine spätere Edition hat ein Entity entfernt, das benötigt wird, um die angegebene Edition als aktuelle Edition wiederherzustellen

# Container_CanReinstateHistoryEdition_Reason_SaltRemoved
source: The salt of the specified edition was removed to prevent reinstating it as current edition.
de_de: Das Salt der angegebenen Edition wurde entfernt um zu verhindern, dass sie als aktuelle Edition wiederhergestellt wird.

# Container_FinishInitialization_InvalidOperation_NoEntity
source: The container needs at least one entity.
de_de: Der Container muss mindestens ein Entity enthalten.

# Container_LoadAndValidate_ContainerHistoryFound
source: Container history '{0}' found.
de_de: Container-History '{0}' gefunden.

# Container_LoadAndValidate_ContainerHistoryMissing
source: Container history '{0}' is missing.
de_de: Container-History '{0}' fehlt.

# Container_LoadAndValidate_CurrentEditionFound
source: Current edition '{0}' found.
de_de: Aktuelle Edition '{0}' gefunden.

# Container_LoadAndValidate_CurrentEditionIsMissing
source: Current edition '{0}' is missing.
de_de: Aktuelle Edition '{0}' fehlt.

# Container_LoadAndValidate_EntityIndexFound
source: Entity index '{0}' found.
de_de: Entity-Index '{0}' gefunden.

# Container_LoadAndValidate_EntityIndexMissing
source: Entity index '{0}' is missing.
de_de: Entity-Index '{0}' fehlt.

# Container_LoadAndValidate_HistoryElementNotFound
source: History document does not contain history element.
de_de: Das Container-History-Dokument enthält kein History-XML-Element.

# Container_LoadAndValidate_IndexElementNotFound
source: Entity index document does not contain the index element.
de_de: Das Entity-Index-Dokument enthält kein Index-XML-Element.

# Container_LoadAndValidate_MasterSignatureCanNotBeVerified
source: The master signature can not be verified.
de_de: Die Haupt-Signatur kann nicht verifiziert werden.

# Container_LoadAndValidate_NoCertificateFound
source: No certificate found in current edition. Validation is canceled.
de_de: Kein Zertifikat in der aktuellen Edition gefunden. Validierung wird abgebrochen.

# Container_NewEntity_ArgumentException_PredecessorDoesNotExist
source: One of the given predecessors does not exist.
de_de: Einer der angegebenen Vorgänger existert nicht.

# Container_NewEntity_InvalidOperation_WrongPhase
source: The container must be in the initialization or transformation phase to add a new entity.
de_de: Der Container muss in der Prozessphase 'Initialization' oder 'Transformation' sein, damit neue Entities hinzugefügt werden können.

# Container_NewEntity_LabelAllreadyInUse
source: The given label is allready in use.
de_de: Das angegebene Label wird bereits verwendet.

# Container_OpenContainer_ArgumentException_PathNotFound
source: The given path was not found: {0}
de_de: Der angegebene Pfad existiert nicht: {0}

# Container_Open_ContainerInvalid
source: The container is invalid.
de_de: Container ist ungültig.

# Container_Open_ContainerIsValid
source: The container is valid. Check the value signatures!
de_de: Container ist gültig. (Signaturen der Entity-Werte wurden noch nicht geprüft.)

# Container_ReinstateHistoryEdition_ReinstatingEditionImpossible
source: Reinstating the specified edition is impossible: {0}
de_de: Wiederherstellung der angegebenen Edition als aktuelle Edition ist nicht möglich: {0}

# Container_RemoveEntity_InvalidOperation_WrongPhase
source: The container must be in the transformation phase to remove an entity.
de_de: Der Container muss sich in der Prozessphase 'Transformation', damit ein Entity entfernt werden kann.

# Container_TryLoadXml_ErrorReadingXMLDocument
source: Error while reading the XML document '{0}': '{1}'
de_de: Fehler beim Lesen des XML-Dokumentes '{0}': '{1}'

# Container_ValidateDoubleSignature_CopyOfSignatureIsMissing
source: Copy of signature for '{0}' is missing.
de_de: Kopie der Signatur für '{0}' fehlt.

# Container_ValidateDoubleSignature_InvalidSignatureCopy
source: Copy of signature for '{0}' does not match actual signature.
de_de: Kopie der Signatur für '{0}' stimmt nicht mit Original überein.

# Container_ValidateDoubleSignature_SignatureIsMissing
source: Signature for '{0}' is missing.
de_de: Signatur für '{0}' fehlt.

# Container_ValidateEntities_EntityHeaderFound
source: Found the header of entity {0:00000}.
de_de: Kopf der Entity {0:00000} gefunden.

# Container_ValidateEntities_EntityHeaderIsMissing
source: Header of the entity {0:00000} is missing.
de_de: Kopf der Entity {0:00000} fehlt.

# Container_ValidateEntities_EntityLabelDiffersFromIndexItem
source: Entity label differs from index item: '{0}' not equal '{1}'.
de_de: Label im Kopf des Entity unterscheidet sich vom Label im Index: '{0}' ungleich '{1}'.

# Container_ValidateXml_SchemaError
source: XML Schema error in '{0}': {1}
de_de: Fehler beim Überprüfen des XML Schemas in '{0}': {1}

# Container_ValidateXml_XMLValid
source: Validation of XML document '{0}' succeeded.
de_de: Validierung des XML-Dokumentes '{0}' war erfolgreich.

# Container_VerifyEntityValueSignatures_AllEntityValuesIntegerAndAuthentic
source: All entity values are integer and authentic.
de_de: Alle Entity-Werte sind unverändert und authentisch.

# Container_VerifyEntityValueSignatures_InvalidOperation_ContainerNotSealed
source: The integrity check is only allowed, if the container is sealed.
de_de: Die Überprüfung der Integrität ist nur möglich, wenn sich der Container in der Prozessphase 'Sealed' befindet.

# DirectoryStorage_Name
source: File System Directory
de_de: Dateisystemverzeichnis

# DirectoryStorage_Remove_StorageException_RemovingFailed
source: The removing of the storage file failed.
de_de: Das Entfernen des Elements aus dem Speicher ist fehlgeschlagen.

# DirectoryStorage_Write_SourceFileNotFound
source: The given source file does not exist.
de_de: Die angegebene Quelldatei existiert nicht.

# DirectoryStorage_Write_StorageException_WritingFailed
source: The writing of the storage file failed.
de_de: Das Schreiben des Elements in den Speicher ist fehlgeschlagen.

# EditionElement_Validate_HistorySignatureInEdition
source: History signature in edition '{0}'
de_de: History-Signatur in Edition '{0}'

# EditionElement_Validate_IdIsEmpty
source: GUID of edition '{0}' is empty.
de_de: GUID der Edition '{0}' ist leer.

# EditionElement_Validate_IndexSignatureInEdition
source: Index signature in edition '{0}'
de_de: Index-Signatur in Edition '{0}'

# EditionElement_Validate_NoHistorySignature
source: History signature in edition '{0}' not set.
de_de: History-Signatur in Edition '{0}' fehlt.

# EditionElement_Validate_NoIndexSignature
source: Index signature in edition '{0}' not set.
de_de: Index-Signatur in Edition '{0}' fehlt.

# EditionElement_Validate_NoOwner
source: Edition '{0}' has no owner.
de_de: Edition '{0}' hat keinen Owner.

# EditionElement_Validate_SoftwareFieldIsEmpty
source: Software field of edition '{0}' is empty.
de_de: Feld Software der Edition '{0}' ist leer.

# EntityElement_Validate_InvalidId
source: The entity ID is less than 0 or greater than 99999.
de_de: Die Entity-ID ist kleiner oder gleich Null.

# EntityElement_Validate_InvalidProvenanceDescription
source: Provenance description in entity header {0} is invalid.
de_de: Die Herkunftsbeschreibung im Kopf des Entity {0} ist ungültig.

# EntityElement_Validate_InvalidProvenanceParameterSetReference
source: Provenance parameter set reference '{0}' in entity header {1} is invalid.
de_de: Herkunftsparametersatz '{0}' im Kopf des Entity {1} ist ungültig.

# EntityElement_Validate_InvalidValueReference
source: Structure of value reference '{0}' in entity header {1} is invalid.
de_de: Struktur der Wert-Referenz '{0}' im Kopf des Entity {1} ist ungültig.

# EntityElement_Validate_StructureIsValid
source: Structure of entity header {0} is valid.
de_de: Struktur des Kopfes von Entity {0} ist in Ordnung.

# EntityType_ValidateEntity_DataTypeMismatch
source: Data type mismatch at value '{0}' in entity '{1}'.
de_de: Der Datentyp des Wertes '{0}' im Entity '{1}' stimmt nicht mit der Angabe im Entity-Typ überein.

# EntityType_ValidateEntity_ProvenanceMismatch
source: Entity type '{0}' of entity '{1}' is no valid output of its provenance '{2}'.
de_de: Der Typ '{0}' des Entity '{1}' ist kein gültiges Erzeugnis der angegebenen Herkunft '{2}'.

# EntityType_ValidateEntity_RequiredValueMissing
source: Required value '{0}' is missing in entity '{1}' of type '{2}.
de_de: Der erforderliche Wert '{0}' im Entity '{1}' vom Typ '{2}' fehlt.

# EntityType_ValidateEntity_UnexpectedValue
source: Value '{0}' in entity '{1}' is not part of type '{2}'.
de_de: Der Wert '{0}' im Entity '{1}' ist nach dem Typ '{2}' nicht erlaubt.

# EntityType_ValidateEntity_UnknownProvenance
source: Provenance '{0}' of entity '{1}' is unknown.
de_de: Die Herkunft '{0}' des Entity '{1}' ist unbekannt.

# EntityType_ValidateEntity_Valid
source: Entity {0:00000} '{1}' is valid against its type '{2}'.
de_de: Das Entity {0:00000} '{1}' entspricht seinem Typ '{2}'.

# Entity_AddValue_ArgumentException_NameAllreadyInUse
source: The given value name '{0}' is allready in use.
de_de: Der angegebene Name '{0}' wird bereits verwendet.

# Entity_AddValue_InvalidOperation_NotOpenForChanges
source: This entity is not open for changes.
de_de: Entity ist geschlossen und kann nicht geändert werden.

# Entity_Close_InvalidOperation_EntityAllreadyClosed
source: The entity is allready closed.
de_de: Das Entity ist bereits geschlossen.

# Entity_GetProvenanceParameterSet_NoProvenanceParameterSet
source: This entity does not contain a provenance parameter set.
de_de: Das Entity besitzt keinen Herkunftsparametersatz.

# Entity_GetValue_ArgumentException_NameNotFound
source: No value with the given name '{0}' found.
de_de: Es wurde kein Wert mit dem Namen '{0}' gefunden.

# Entity_RemoveFromStorage_InvalidOperation_EntityNotClosedYet
source: The entity is not closed yet.
de_de: Das Entity ist noch nicht geschlossen.

# Entity_SetProvenanceParameterSet_ArgumentException_TypeIdInvalid
source: The given type ID is invalid.
de_de: Die angegebene Typen-ID ist ungültig.

# Entity_SetProvenanceParameterSet_InvalidOperation_ValueNameAllreadyInUse
source: The given value name '{0}' is allready in use.
de_de: Der angegebene Name '{0}' wird bereits verwendet.

# Entity_SourceFileNotFound
source: The given source file does not exist.
de_de: Die angegebene Quelldatei existiert nicht.

# Entity_ValidateStructure_StructureIsValid
source: Structure of entity {0} is valid.
de_de: Die Struktur von Entity {0} ist in Ordnung.

# Entity_VerifyValueSignatures_AllValueSignaturesAuthentic
source: All value signatures in the entity {0} are authentic.
de_de: Alle Werte im Entity {0} sind authentisch.

# HashBuilder_ArgumentNullException_Target
source: Use Stream.Null, if the data should be discarded.
de_de: Verwenden Sie Stream.Null, wenn die Daten verworfen werden sollen.

# HashProvider_CreateHashBuilder_ArgumentException_StreamIsNotWritable
source: The given stream is not writable.
de_de: In den übergebenen Stream kann nicht geschrieben werden.

# HashProvider_NotSupported_HashAlgorithm
source: The requested hash algorithm is not supported.
de_de: Der angeforderte Prüfsummen-Algorithmus wird nicht unterstützt.

# HistoryElement_InvalidOperation_NoItems
source: The history contains no items.
de_de: Die Container-History ist leer.

# HistoryElement_Validate_InvalidItem
source: History item {0} is invalid.
de_de: Der Container-History-Eintrag {0} ist ungültig.

# HistoryElement_Validate_StructureIsValid
source: Structure of history is valid.
de_de: Struktur der Container-History ist in Ordnung.

# HistoryItemElement_Validate_EditionInHistoryItem
source: Edition in history item '{0}'
de_de: Edition in History-Eintrag '{0}'

# HistoryItemElement_Validate_NoEdition
source: Edition in history item '{0}' is missing.
de_de: Edition in History-Eintrag '{0}' fehlt.

# HistoryItemElement_Validate_NoPastMasterSignature
source: Past master signature in history item '{0}' is missing'.
de_de: Vorherige Haupt-Signatur im History-Eintrag '{0}' fehlt.

# HistoryItemElement_Validate_PastMasterSignatureInHistoryItem
source: Past master signature in history item '{0}'
de_de: Vorherige Haupt-Signatur im History-Eintrag '{0}'

# HistoryItemElement_Validate_ValidStructure
source: Structure of history item '{0}' is valid.
de_de: Struktur des History-Eintrags '{0}' ist in Ordnung.

# IndexElement_Add_ArgumentException_InvalidEntityReference
source: The id of the given entity reference is invalid.
de_de: Die ID der übergebenen Entity-Referenz ist ungültig.

# IndexElement_ArgumentException_EntityIdNotFound
source: No entity with id {0} in the index.
de_de: Der Index enthält keinen Eintrag mit der ID {0}.

# IndexElement_Validate_IndexIsEmpty
source: Entity index is empty.
de_de: Der Index ist leer.

# IndexElement_Validate_IndexItemIsInvalid
source: Index item '{0}' is invalid.
de_de: Der Index-Eintrag '{0}' ist ungültig.

# IndexElement_Validate_MultipleUseOfLabel
source: Label of item '{0}' is used more than once.
de_de: Das Label von Index-Eintrag '{0}' wird mehr als einmal verwendet.

# IndexElement_Validate_ValidStructure
source: Structure of entity index is valid.
de_de: Struktur des Index ist in Ordnung.

# IndexItemElement_Validate_EntitySignatureInIndexItem
source: Entity signature in index item '{0}'
de_de: Entity-Signatur im Index-Eintrag '{0}'

# IndexItemElement_Validate_InvalidId
source: ID in index item is less or equal zero.
de_de: Eine ID in einem Index-Eintrag ist kleiner oder gleich Null.

# IndexItemElement_Validate_NoEntitySignature
source: Entity signature in index item '{0}' is missing.
de_de: Die Entity-Signatur im Index-Eintrag '{0}' fehlt.

# IndexItemElement_Validate_ValidStructure
source: Structure of index item '{0}' is valid.
de_de: Struktur des Index-Eintrags '{0}' ist in Ordnung.

# Owner_Validate_NoCertificate
source: Owner certificate is missing.
de_de: Owner-Zertifikat fehlt.

# Owner_Validate_NoEmail
source: Email field in owner is empty.
de_de: Email-Feld im Owner ist leer.

# Owner_Validate_NoInstitute
source: Institute field in owner is empty.
de_de: Institute-Feld im Owner ist leer.

# Owner_Validate_NoOperator
source: Operator field in owner is empty.
de_de: Operator-Feld im Owner ist leer.

# Owner_Validate_ValidStructure
source: Structure of owner '{0}' is valid.
de_de: Struktur der Owner-Beschreibung '{0}' ist in Ordnung.

# Profile_LoadFromXml_FormatException_ProfileNotSchemaConform
source: The profile is not schema conform: {0}
de_de: Das Profil entspricht nicht dem XML-Schema: {0}

# Profile_LoadFromXml_WrongNamespace
source: The given XML element is not in the expected namespace.
de_de: Das übergebene XML-Element befindet sich nicht im erwarteten XML-Namensraum.

# Profile_LoadFromXml_WrongXmlElement
source: The given XML element is not a Profile element.
de_de: Das übergebene XML-Element ist kein Profile-Element.

# Profile_ValidateContainer_ProfileMismatch
source: The profile of the container '{0}' does not match the validating profile '{1}'.
de_de: Das Profil des Container '{0}' entspricht nicht dem zur Validierung verwendeten Profil '{1}'.

# Profile_ValidateContainer_ProfileVersionMismatch
source: The profile version of the container '{0}' does not match the validating profile version '{1}'.
de_de: Die Profilversion im Container '{0}' entspricht nicht der zur Validierung verwendeten Profilversion '{1}'.

# Profile_ValidateEntity_UnkownEntityType
source: Type '{0}' of entity '{1}' is unknown.
de_de: Der Typ '{0}' des Entity '{1}' ist unbekannt.

# RSAProvider_NotSupported_NoCertificate
source: The crypto provider has no access to the certificate.
de_de: Der Kryptographieanbieter hat keinen Zugriff auf ein Zertifikat.

# RSAProvider_NotSupported_NoPrivateKey
source: This instance has no access to the private key.
de_de: Diese Instanz hat keinen Zugriff auf einen privaten Schlüssel.

# RSAProvider_ValidateCertificate_Failed
source: The verification of the certificate from '{0}' failed. {1}
de_de: Die Verifikation des Zertifikats von '{0}' ist fehlgeschlagen. {1}

# RSAProvider_ValidateCertificate_Succeeded
source: The verification of the certificate from '{0}' succeeded.
de_de: Die Verifikation des Zertifikats von '{0}' war erfolgreich.

# SignatureWrapper_ArgumentException_SourceNotReadable
source: The data source is not readable.
de_de: Aus der Datenquelle kann nicht gelesen werden.

# SignatureWrapper_ReadFromXml_NoSignatureElement
source: The given XML element does not contain a 'Signature' child element.
de_de: Das übergebene XML-Element enthält kein 'Signature'-Kindelement.

# SignatureWrapper_ValidateStructure_NoDataReference
source: Signed info in the signature of '{0}' contains no data reference.
de_de: Das SignedInfo-Element in der Signatur von '{0}' enthält keine Datenreferenz.

# SignatureWrapper_ValidateStructure_NoSignature
source: Signature wrapper of '{0}' does not contain a signature.
de_de: Signatur-Wrapper von '{0}' enthält keine Signatur.

# SignatureWrapper_ValidateStructure_NoSignatureValue
source: Signature of '{0}' does not contain a signature value.
de_de: Signatur von '{0}' enthält keinen Signaturwert.

# SignatureWrapper_ValidateStructure_NoSignedInfo
source: Signature of '{0}' does not contain a signed info.
de_de: Signatur von '{0}' enthält kein SignedInfo-Element.

# SignatureWrapper_ValidateStructure_ValidStructure
source: Structure of signature of '{0}' is valid.
de_de: Struktur der Signatur von '{0}' ist in Ordnung.

# SignatureWrapper_VerifyDigest_DataIsInteger
source: Data of '{0}' is intact.
de_de: Daten von '{0}' sind unverändert.

# SignatureWrapper_VerifyDigest_DataNotInteger
source: Data of '{0}' was altered.
de_de: Daten von '{0}' wurden verändert.

# SignatureWrapper_VerifyDigest_DigestAlgorithmNotSupported
source: The digest algorithm used in the signature is not supported.
de_de: Der Prüfsummen-Algorithmus der in der XML-Signatur verwendet wurde, wird nicht unterstützt.

# SignatureWrapper_VerifyDigest_UriMismatch
source: URI in signature of '{0}' does not match the given URI.
de_de: URI in Signature von '{0}' stimmt nicht mit der angebenen URI überein.

# SignatureWrapper_VerifySignature_CanonicalizerNotSupported
source: Canonicalizer '{0}' used in the XML signature '{1}' is not supported.
de_de: Der Kanonisierer '{0}' der in der XML-Signatur '{1}' wird nicht unterstützt.

# SignatureWrapper_VerifySignature_SignatureAlgorithmNotSupported
source: Signature algorithm '{0}' used in the XML signature '{1}' is not supported.
de_de: Der Signatur-Algorithmus '{0}' der in der XML-Signatur '{1}' wird nicht unterstützt.

# SignatureWrapper_VerifySignature_SignatureIsAuthentic
source: Signature of '{0}' is authentic.
de_de: Signatur von '{0}' ist authentisch.

# SignatureWrapper_VerifySignature_SignatureNotAuthentic
source: Signature of '{0}' is not authentic.
de_de: Signature von '{0}' ist nicht authentisch.

# SignatureWrapper_WriteToXml_InvalidOperation_NoSignature
source: There is no Signature set.
de_de: Die Signatur fehlt.

# Storage_ArgumentException_EmptyPath
source: The given path is empty.
de_de: Der übergebene Pfad ist leer.

# Storage_Read_OpeningFailed
source: The opening of the storage file for reading failed.
de_de: Öffnen des Speicherelements zum Lesen ist fehlgeschlagen.

# Storage_StorageFileNotFound
source: The storage file, specified by the given relative path was not found.
de_de: Das über den relativen Pfad angegebene Speicherelement wurde nicht gefunden.

# Storage_Write_StreamNotReadable
source: The given stream is not readable.
de_de: Aus dem übergebenen Stream kann nicht gelesen werden.

source: unlabeled
de_de: Unbenannt

# Value_InvalidOperation_ValueNotStoredYet
source: The value is not stored yet.
de_de: Der Wert wurde bisher nicht gespeichert.

# Value_Read_InvalidOperation_ValueAppearanceIsSuppressed
source: The value appearance is suppressed.
de_de: Der Wert ist als 'suppressed' markiert.

# Value_ValidateStructure_SignatureMissing
source: Signature of '{0}' is missing.
de_de: Signatur von '{0}' fehlt.

# Value_ValidateStructure_StructureIsValid
source: Structure of '{0}' is valid.
de_de: Structure von '{0}' ist in Ordnung.

# Value_ValidateStructure_ValueFileMissing
source: Value data file '{0}' is missing.
de_de: Speicherelement für den Wert '{0}' fehlt.

# Value_ValidateStructure_ValueFileNotExpected
source: Value data file '{0}' is present but its appearance is marked as 'suppressed'.
de_de: Speicherelement für den Wert '{0}' ist vorhanden obwohl der Wert als 'suppressed' markiert ist.

# Value_WriteAndSignValue_InvalidOperation_NoSourceFileGiven
source: No source file was given to the constructor.
de_de: Es wurde keine Datei an den Konstruktor übergeben.
